In [1]:
import numpy as np
import pandas as pd

# Operators

In [2]:
dict1={'Name':['arham','ali','ahmad','arslan','Usama','majid','abbad','amir','khurram']
       ,'Marks':[88,56,77,56,44,87,57,95,44],
         'Grades':['A','C','B','C','D','A','C','A','D'] }
df=pd.DataFrame(dict1,index=['stu 1','stu 2','stu 3','stu 4','stu 5','stu 6','stu 7','stu 8','stu 9'])

In [3]:
df

          Name  Marks Grades
stu 1    arham     88      A
stu 2      ali     56      C
stu 3    ahmad     77      B
stu 4   arslan     56      C
stu 5    Usama     44      D
stu 6    majid     87      A
stu 7    abbad     57      C
stu 8     amir     95      A
stu 9  khurram     44      D

In [4]:
df['Marks']>90

stu 1    False
stu 2    False
stu 3    False
stu 4    False
stu 5    False
stu 6    False
stu 7    False
stu 8     True
stu 9    False
Name: Marks, dtype: bool

In [5]:
df[df['Marks']>90]

       Name  Marks Grades
stu 8  amir     95      A

In [6]:
df['Grades']=='A'

stu 1     True
stu 2    False
stu 3    False
stu 4    False
stu 5    False
stu 6     True
stu 7    False
stu 8     True
stu 9    False
Name: Grades, dtype: bool

In [7]:
df[df['Grades']=='A']

        Name  Marks Grades
stu 1  arham     88      A
stu 6  majid     87      A
stu 8   amir     95      A

In [8]:
(df['Grades']=='A') & (df["Marks"]>80)

stu 1     True
stu 2    False
stu 3    False
stu 4    False
stu 5    False
stu 6     True
stu 7    False
stu 8     True
stu 9    False
dtype: bool

In [9]:
df[df['Marks']>90] ["Name"]

stu 8    amir
Name: Name, dtype: object

In [10]:
df[df['Grades']=='A'] ["Name"]

stu 1    arham
stu 6    majid
stu 8     amir
Name: Name, dtype: object

In [11]:
df.loc[df['Marks']>90]

       Name  Marks Grades
stu 8  amir     95      A

In [12]:
df.loc[(df['Grades']=='A') & (df["Marks"]>80)]

        Name  Marks Grades
stu 1  arham     88      A
stu 6  majid     87      A
stu 8   amir     95      A

In [13]:
df[df.iloc[:,1]>90]

       Name  Marks Grades
stu 8  amir     95      A

In [14]:
# marks greater than 80 and grades A
df[(df.iloc[:,1]>80) & (df.iloc[:,2]=='A')]

        Name  Marks Grades
stu 1  arham     88      A
stu 6  majid     87      A
stu 8   amir     95      A

In [15]:
# name of the student having A grade
df[df.iloc[:,2]=='A']["Name"]

stu 1    arham
stu 6    majid
stu 8     amir
Name: Name, dtype: object

# Inserting a columns

In [34]:
dict1={'Name':['arham','ali','ahmad','arslan','Usama','majid','abbad','amir','khurram']
       ,'Marks':[88,56,77,56,44,87,57,95,44]}
df=pd.DataFrame(dict1)
df

      Name  Marks
0    arham     88
1      ali     56
2    ahmad     77
3   arslan     56
4    Usama     44
5    majid     87
6    abbad     57
7     amir     95
8  khurram     44

In [30]:
s1=['A','C','B','C','D','A','C','A','D']
s1

['A', 'C', 'B', 'C', 'D', 'A', 'C', 'A', 'D']

In [31]:
df['Grades']=s1

In [32]:
df

      Name  Marks Grades
0    arham     88      A
1      ali     56      C
2    ahmad     77      B
3   arslan     56      C
4    Usama     44      D
5    majid     87      A
6    abbad     57      C
7     amir     95      A
8  khurram     44      D